ДО_для_разработки/src/InformationRegisters/РабочиеГруппы/РабочиеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РабочиеГруппы</name>
  <resources>
    <name>Изменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>CatalogRef.ГруппыКонтактовПользователей</types>
      <types>CatalogRef.ШаблоныПриглашения</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.РабочиеГруппы</types>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьУчастник</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.РабочиеГруппы</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/InformationRegisters/ДескрипторыДляОбъектов/ДескрипторыДляОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДескрипторыДляОбъектов</name>
  <resources>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолученОт</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ШаблоныПисем</types>
      <types>CatalogRef.ТемыОбсуждений</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ШаблоныУтверждения</types>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.ПравилаОбработкиПисем</types>
      <types>CatalogRef.НоменклатураДел</types>
      <types>CatalogRef.Инструкции</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>CatalogRef.ГруппыКонтрольныхТочек</types>
      <types>CatalogRef.ПапкиФайлов</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныКонтрольныхТочек</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>CatalogRef.СпискиРассылкиПоКонтрагентам</types>
      <types>CatalogRef.ШаблоныОзнакомления</types>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
      <types>CatalogRef.МестаХраненияДел</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.КатегорииДанных</types>
      <types>CatalogRef.ВидыМероприятий</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.СерверныеСообщенияСВД</types>
      <types>CatalogRef.ШаблоныТекстов</types>
      <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
      <types>CatalogRef.РазделыНоменклатурыДел</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныРассмотрения</types>
      <types>CatalogRef.ШаблоныСогласования</types>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.ПапкиПисем</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.Резолюции</types>
      <types>CatalogRef.ШаблоныПоручения</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
      <types>CatalogRef.ШаблоныГруппКонтрольныхТочек</types>
      <types>CatalogRef.ПапкиФорума</types>
      <types>CatalogRef.ГрифыДоступа</types>
      <types>CatalogRef.ВизыСогласования</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ДелаХраненияДокументов</types>
      <types>CatalogRef.ГруппыКонтактовПользователей</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ШаблоныПриглашения</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.ПапкиПроектов</types>
      <types>CatalogRef.ШаблоныИсполнения</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>CatalogRef.ВопросыДеятельности</types>
      <types>CatalogRef.ШаблоныРегистрации</types>
      <types>DocumentRef.ПередачаДелВАрхив</types>
      <types>CatalogRef.ЭДПрисоединенныеФайлы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>CatalogRef.ПапкиМероприятий</types>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
      <types>DocumentRef.УничтожениеДел</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дескриптор</name>
    <type>
      <types>CatalogRef.ДескрипторыДоступаОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДескриптора</name>
    <comment>0 - основной; 1 - по рабочей группе; 2 - индивидуальный; 3 - от владельца; 4 - для локальных администраторов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/InformationRegisters/УчастникиПроцессов/УчастникиПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиПроцессов</name>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьУчастник</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/InformationRegisters/РабочиеГруппы/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		ОбработанныеОбъекты = Новый Соответствие;
		ТипыОбъектовВходящихВМеханизмПрав = 
			ДокументооборотПраваДоступаПовтИсп.ТипыСсылокИспользующихДоступПоДескрипторам();
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			ТекущийОбъект = Запись.Объект;
			Если ОбработанныеОбъекты.Получить(ТекущийОбъект) = Неопределено Тогда
				ТипОбъекта = ТипЗнч(ТекущийОбъект);
				Если ТипыОбъектовВходящихВМеханизмПрав.Найти(ТипОбъекта) <> Неопределено Тогда
					
					Если РегистрыСведений.ДескрипторыДляОбъектов.ЕстьДескрипторыОбъекта(ТекущийОбъект) Тогда
						ДокументооборотПраваДоступа.ОпределитьДескрипторыОбъекта(ТекущийОбъект);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			ОбработанныеОбъекты.Вставить(ТекущийОбъект);
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектОтбора = ЭтотОбъект.Отбор.Объект.Значение;
	Если ЗначениеЗаполнено(ОбъектОтбора) И ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектОтбора.Метаданные()) Тогда
		
		// Запись в РС УчастникиПроцессов
		НаборИзменен = Ложь;
		ТаблицаНабора = РегистрыСведений.УчастникиПроцессов.ПолучитьУчастников(ОбъектОтбора);
		СтруктураПоиска = Новый Структура("Участник");
		
		Для Каждого СтрокаРГ Из ЭтотОбъект Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРГ);
			НайденныеСтроки = ТаблицаНабора.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НаборИзменен = Истина;
				ЗаполнитьЗначенияСвойств(ТаблицаНабора.Добавить(), СтрокаРГ);
			КонецЕсли;
		КонецЦикла;
		
		Если НаборИзменен Тогда
			РегистрыСведений.УчастникиПроцессов.ЗаписатьНаборПоПроцессу(ОбъектОтбора, ТаблицаНабора);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
